<a href="https://colab.research.google.com/github/alexsandro-matias/lab_dio/blob/main/aula04_Trabalhando_arquivos_Excel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Utilizando Arquivo do Excel para Análise de Dados

## Lendo os arquivos e depois mesclando-os

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel("/content/Aracaju.xlsx")
df2 = pd.read_excel("/content/Fortaleza.xlsx")
df3 = pd.read_excel("/content/Natal.xlsx")
df4 = pd.read_excel("/content/Recife.xlsx")
df5 = pd.read_excel("/content/Salvador.xlsx")

Mesclando as coleções de Dados

In [4]:
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [7]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

Para uma amostragem aleatória do dataframe.

In [11]:
df.sample(10)

        Cidade       Data  Vendas  LojaID  Qtde
213      Natal 2019-01-02   42.12    1035     1
116    Aracaju 2018-01-01   48.44    1522     4
104  Fortaleza 2019-01-01   40.50    1005     2
96      Recife 2019-01-01  165.36     982     7
200   Salvador 2019-01-02   41.06    1035     1
84       Natal 2019-01-02   22.99    1036     1
30       Natal 2018-10-02  856.00     853     4
141   Salvador 2019-03-02    9.08    1036     1
117      Natal 2019-01-02   39.41    1034     1
37     Aracaju 2018-01-01  152.74    1522     9

Neste exemplo, como os ID's das lojas não sofrerão nenhum cálculo, esses serão convertidos para o tipo texto.

In [13]:
df['LojaID'] = df['LojaID'].astype("object")

Para testar o efeito, verificaremos o tipo dos ID's:

In [14]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

# Verificando valores nulos ou faltantes

Primeiramente, verificando os valores faltantes:

In [16]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64